## 📋 Terraform Plan (DEV)

### Summary
Summary not available

<details>
<summary>Show Plan Details</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.api.aws_api_gateway_deployment.main must be replaced
+/- resource "aws_api_gateway_deployment" "main" {
      ~ created_date = "2026-01-12T06:49:31Z" -> (known after apply)
      ~ id           = "quozix" -> (known after apply)
      ~ triggers     = {
          - "redeployment" = "da63b1d665290eb57f0b6abb70b202c74f33b7d7"
        } -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.admin_mindmaps_get will be created
  + resource "aws_api_gateway_integration" "admin_mindmaps_get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "4lfu0fgsk3"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_api_gateway_integration.admin_mindmaps_id_delete will be created
  + resource "aws_api_gateway_integration" "admin_mindmaps_id_delete" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "DELETE"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "4lfu0fgsk3"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_api_gateway_integration.admin_mindmaps_id_get will be created
  + resource "aws_api_gateway_integration" "admin_mindmaps_id_get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "4lfu0fgsk3"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_api_gateway_integration.admin_mindmaps_id_options will be created
  + resource "aws_api_gateway_integration" "admin_mindmaps_id_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = "4lfu0fgsk3"
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_mindmaps_id_put will be created
  + resource "aws_api_gateway_integration" "admin_mindmaps_id_put" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PUT"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "4lfu0fgsk3"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_api_gateway_integration.admin_mindmaps_options will be created
  + resource "aws_api_gateway_integration" "admin_mindmaps_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = "4lfu0fgsk3"
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.admin_mindmaps_post will be created
  + resource "aws_api_gateway_integration" "admin_mindmaps_post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "4lfu0fgsk3"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_api_gateway_integration.public_mindmaps_get will be created
  + resource "aws_api_gateway_integration" "public_mindmaps_get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "4lfu0fgsk3"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_api_gateway_integration.public_mindmaps_id_get will be created
  + resource "aws_api_gateway_integration" "public_mindmaps_id_get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "ap-northeast-1"
      + resource_id             = (known after apply)
      + response_transfer_mode  = (known after apply)
      + rest_api_id             = "4lfu0fgsk3"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.api.aws_api_gateway_integration.public_mindmaps_id_options will be created
  + resource "aws_api_gateway_integration" "public_mindmaps_id_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = "4lfu0fgsk3"
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration.public_mindmaps_options will be created
  + resource "aws_api_gateway_integration" "public_mindmaps_options" {
      + cache_namespace        = (known after apply)
      + connection_type        = "INTERNET"
      + http_method            = "OPTIONS"
      + id                     = (known after apply)
      + passthrough_behavior   = (known after apply)
      + region                 = "ap-northeast-1"
      + request_templates      = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id            = (known after apply)
      + response_transfer_mode = (known after apply)
      + rest_api_id            = "4lfu0fgsk3"
      + timeout_milliseconds   = 29000
      + type                   = "MOCK"
    }

  # module.api.aws_api_gateway_integration_response.admin_mindmaps_id_options will be created
  + resource "aws_api_gateway_integration_response" "admin_mindmaps_id_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,PUT,DELETE,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "4lfu0fgsk3"
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.admin_mindmaps_options will be created
  + resource "aws_api_gateway_integration_response" "admin_mindmaps_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,POST,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "4lfu0fgsk3"
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.public_mindmaps_id_options will be created
  + resource "aws_api_gateway_integration_response" "public_mindmaps_id_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "4lfu0fgsk3"
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_integration_response.public_mindmaps_options will be created
  + resource "aws_api_gateway_integration_response" "public_mindmaps_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization,X-Amz-Date,X-Api-Key,X-Amz-Security-Token'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "4lfu0fgsk3"
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_get will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "klt512"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_id_delete will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_id_delete" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = "klt512"
      + http_method        = "DELETE"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_id_get will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_id_get" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = "klt512"
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_id_options will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_id_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_id_put will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_id_put" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = "klt512"
      + http_method        = "PUT"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_options will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_method.admin_mindmaps_post will be created
  + resource "aws_api_gateway_method" "admin_mindmaps_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = "klt512"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_method.public_mindmaps_get will be created
  + resource "aws_api_gateway_method" "public_mindmaps_get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_method.public_mindmaps_id_get will be created
  + resource "aws_api_gateway_method" "public_mindmaps_id_get" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_method.public_mindmaps_id_options will be created
  + resource "aws_api_gateway_method" "public_mindmaps_id_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_method.public_mindmaps_options will be created
  + resource "aws_api_gateway_method" "public_mindmaps_options" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + region           = "ap-northeast-1"
      + resource_id      = (known after apply)
      + rest_api_id      = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_method_response.admin_mindmaps_id_options will be created
  + resource "aws_api_gateway_method_response" "admin_mindmaps_id_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "4lfu0fgsk3"
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method_response.admin_mindmaps_options will be created
  + resource "aws_api_gateway_method_response" "admin_mindmaps_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "4lfu0fgsk3"
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method_response.public_mindmaps_id_options will be created
  + resource "aws_api_gateway_method_response" "public_mindmaps_id_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "4lfu0fgsk3"
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_method_response.public_mindmaps_options will be created
  + resource "aws_api_gateway_method_response" "public_mindmaps_options" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + region              = "ap-northeast-1"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "4lfu0fgsk3"
      + status_code         = "200"
    }

  # module.api.aws_api_gateway_resource.admin_mindmaps will be created
  + resource "aws_api_gateway_resource" "admin_mindmaps" {
      + id          = (known after apply)
      + parent_id   = "53axfk"
      + path        = (known after apply)
      + path_part   = "mindmaps"
      + region      = "ap-northeast-1"
      + rest_api_id = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_resource.admin_mindmaps_id will be created
  + resource "aws_api_gateway_resource" "admin_mindmaps_id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + region      = "ap-northeast-1"
      + rest_api_id = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_resource.public will be created
  + resource "aws_api_gateway_resource" "public" {
      + id          = (known after apply)
      + parent_id   = "cghl5qu7yb"
      + path        = (known after apply)
      + path_part   = "public"
      + region      = "ap-northeast-1"
      + rest_api_id = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_resource.public_mindmaps will be created
  + resource "aws_api_gateway_resource" "public_mindmaps" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "mindmaps"
      + region      = "ap-northeast-1"
      + rest_api_id = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_resource.public_mindmaps_id will be created
  + resource "aws_api_gateway_resource" "public_mindmaps_id" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{id}"
      + region      = "ap-northeast-1"
      + rest_api_id = "4lfu0fgsk3"
    }

  # module.api.aws_api_gateway_stage.main will be updated in-place
  ~ resource "aws_api_gateway_stage" "main" {
      ~ deployment_id         = "quozix" -> (known after apply)
        id                    = "ags-4lfu0fgsk3-dev"
        tags                  = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Module"      = "api"
            "Project"     = "serverless-blog"
        }
        # (15 unchanged attributes hidden)
    }

  # module.api.aws_lambda_permission.create_mindmap will be created
  + resource "aws_lambda_permission" "create_mindmap" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:881302602065:4lfu0fgsk3/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.api.aws_lambda_permission.delete_mindmap will be created
  + resource "aws_lambda_permission" "delete_mindmap" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:881302602065:4lfu0fgsk3/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.api.aws_lambda_permission.get_mindmap will be created
  + resource "aws_lambda_permission" "get_mindmap" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:881302602065:4lfu0fgsk3/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.api.aws_lambda_permission.get_public_mindmap will be created
  + resource "aws_lambda_permission" "get_public_mindmap" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:881302602065:4lfu0fgsk3/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.api.aws_lambda_permission.list_mindmaps will be created
  + resource "aws_lambda_permission" "list_mindmaps" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:881302602065:4lfu0fgsk3/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.api.aws_lambda_permission.list_public_mindmaps will be created
  + resource "aws_lambda_permission" "list_public_mindmaps" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:881302602065:4lfu0fgsk3/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.api.aws_lambda_permission.update_mindmap will be created
  + resource "aws_lambda_permission" "update_mindmap" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:881302602065:4lfu0fgsk3/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.cdn.aws_cloudfront_distribution.main will be updated in-place
  ~ resource "aws_cloudfront_distribution" "main" {
        id                              = "E2311S28V7SC21"
        tags                            = {
            "Environment" = "dev"
            "ManagedBy"   = "Terraform"
            "Module"      = "cdn"
            "Name"        = "blog-cdn-dev"
            "Project"     = "serverless-blog"
        }
        # (25 unchanged attributes hidden)

      ~ default_cache_behavior {
            # (16 unchanged attributes hidden)

          - function_association {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          + function_association {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

            # (1 unchanged block hidden)
        }

      ~ ordered_cache_behavior {
            # (17 unchanged attributes hidden)

          - function_association {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }
          + function_association {
              # At least one attribute in this block is (or was) sensitive,
              # so its contents will not be displayed.
            }

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.cdn.aws_cloudfront_function.admin_combined[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cloudfront_function" "admin_combined" {
      - arn                          = "arn:aws:cloudfront::881302602065:function/AdminCombinedFunction-dev" -> null
      - code                         = (sensitive value) -> null
      - comment                      = "Combined Basic Auth and SPA routing for Admin site (dev)" -> null
      - etag                         = "ETVPDKIKX0DER" -> null
      - id                           = "AdminCombinedFunction-dev" -> null
      - key_value_store_associations = [] -> null
      - live_stage_etag              = "E3UN6WX5RRO2AG" -> null
      - name                         = "AdminCombinedFunction-dev" -> null
      - publish                      = true -> null
      - runtime                      = "cloudfront-js-2.0" -> null
      - status                       = "DEPLOYED" -> null
    }

  # module.cdn.aws_cloudfront_function.admin_spa[0] will be created
  + resource "aws_cloudfront_function" "admin_spa" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
              var uri = request.uri;
            
              // SPA routing: Keep /admin prefix to avoid cache key collision with public site
              // Admin files are stored in S3 under /admin/ prefix
              if (uri.startsWith('/admin')) {
                // For paths without file extension, serve /admin/index.html
                if (uri === '/admin' || uri === '/admin/') {
                  uri = '/admin/index.html';
                } else if (!uri.substring(6).includes('.')) {
                  // SPA route (e.g., /admin/dashboard) -> serve /admin/index.html
                  uri = '/admin/index.html';
                }
                // Paths with extensions (e.g., /admin/assets/foo.js) pass through unchanged
              }
            
              request.uri = uri;
              return request;
            }
        EOT
      + comment         = "SPA routing for Admin site - strips /admin prefix and handles SPA routes"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "AdminSpaFunction-dev"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # module.cdn.aws_cloudfront_function.basic_auth[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cloudfront_function" "basic_auth" {
      - arn                          = "arn:aws:cloudfront::881302602065:function/BasicAuthFunction-dev" -> null
      - code                         = (sensitive value) -> null
      - comment                      = "Basic Authentication for dev environment" -> null
      - etag                         = "ETVPDKIKX0DER" -> null
      - id                           = "BasicAuthFunction-dev" -> null
      - key_value_store_associations = [] -> null
      - live_stage_etag              = "E3UN6WX5RRO2AG" -> null
      - name                         = "BasicAuthFunction-dev" -> null
      - publish                      = true -> null
      - runtime                      = "cloudfront-js-2.0" -> null
      - status                       = "UNASSOCIATED" -> null
    }

  # module.cdn.aws_cloudfront_function.public_combined[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cloudfront_function" "public_combined" {
      - arn                          = "arn:aws:cloudfront::881302602065:function/PublicCombinedFunction-dev" -> null
      - code                         = (sensitive value) -> null
      - comment                      = "Combined Basic Auth and SSG routing for public site (dev)" -> null
      - etag                         = "E3UN6WX5RRO2AG" -> null
      - id                           = "PublicCombinedFunction-dev" -> null
      - key_value_store_associations = [] -> null
      - live_stage_etag              = "E3UN6WX5RRO2AG" -> null
      - name                         = "PublicCombinedFunction-dev" -> null
      - publish                      = true -> null
      - runtime                      = "cloudfront-js-2.0" -> null
      - status                       = "DEPLOYED" -> null
    }

  # module.cdn.aws_cloudfront_function.public_spa[0] will be created
  + resource "aws_cloudfront_function" "public_spa" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
              var request = event.request;
              var uri = request.uri;
            
              // SPA routing: For paths without file extension, serve /index.html
              if (uri === '/' || uri === '') {
                request.uri = '/index.html';
              } else if (!uri.includes('.')) {
                // SPA route (e.g., /about, /posts/123) -> serve /index.html
                request.uri = '/index.html';
              }
              // Paths with extensions (e.g., /assets/foo.js) pass through unchanged
            
              return request;
            }
        EOT
      + comment         = "SPA routing for Public site (dev)"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "PublicSpaFunction-dev"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # module.codebuild.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.codebuild.aws_iam_role_policy.codebuild_cloudfront will be updated in-place
  ~ resource "aws_iam_role_policy" "codebuild_cloudfront" {
        id          = "serverless-blog-codebuild-astro-role-dev:cloudfront-invalidation-policy"
        name        = "cloudfront-invalidation-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "cloudfront:CreateInvalidation",
                          - "cloudfront:GetInvalidation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudfront::881302602065:distribution/E2311S28V7SC21"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.database.aws_dynamodb_table.mindmaps will be created
  + resource "aws_dynamodb_table" "mindmaps" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = false
      + hash_key                    = "id"
      + id                          = (known after apply)
      + name                        = "serverless-blog-mindmaps"
      + read_capacity               = (known after apply)
      + region                      = "ap-northeast-1"
      + stream_arn                  = (known after apply)
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "database"
          + "Name"        = "serverless-blog-mindmaps"
          + "Project"     = "serverless-blog"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "database"
          + "Name"        = "serverless-blog-mindmaps"
          + "Project"     = "serverless-blog"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "createdAt"
          + type = "S"
        }
      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "publishStatus"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "publishStatus"
          + name               = "PublishStatusIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "createdAt"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)

          + warm_throughput (known after apply)
        }

      + global_table_witness (known after apply)

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl (known after apply)

      + warm_throughput (known after apply)
    }

  # module.lambda.data.archive_file.create_category will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "create_category" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/categories-create.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/categories-create/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.create_mindmap will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "create_mindmap" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/mindmaps-create.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/mindmaps-create/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.create_post will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "create_post" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/posts-create.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/posts-create/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.delete_category will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "delete_category" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/categories-delete.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/categories-delete/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.delete_image will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "delete_image" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/images-delete.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/images-delete/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.delete_mindmap will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "delete_mindmap" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/mindmaps-delete.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/mindmaps-delete/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.delete_post will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "delete_post" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/posts-delete.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/posts-delete/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.get_mindmap will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "get_mindmap" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/mindmaps-get.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/mindmaps-get/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.get_post will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "get_post" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/posts-get.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/posts-get/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.get_public_mindmap will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "get_public_mindmap" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/mindmaps-get_public.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/mindmaps-get_public/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.get_public_post will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "get_public_post" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/posts-get_public.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/posts-get_public/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.get_upload_url will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "get_upload_url" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/images-get_upload_url.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/images-get_upload_url/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.list_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "list_categories" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/categories-list.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/categories-list/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.list_mindmaps will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "list_mindmaps" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/mindmaps-list.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/mindmaps-list/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.list_posts will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "list_posts" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/posts-list.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/posts-list/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.list_public_mindmaps will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "list_public_mindmaps" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/mindmaps-list_public.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/mindmaps-list_public/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.login will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "login" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/auth-login.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/auth-login/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.logout will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "logout" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/auth-logout.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/auth-logout/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.refresh will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "refresh" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/auth-refresh.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/auth-refresh/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.update_categories_sort_order will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "update_categories_sort_order" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/categories-bulk_sort.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/categories-bulk_sort/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.update_category will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "update_category" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/categories-update.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/categories-update/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.update_mindmap will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "update_mindmap" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/mindmaps-update.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/mindmaps-update/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.archive_file.update_post will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "update_post" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_file_mode    = "0644"
      + output_md5          = (known after apply)
      + output_path         = "../../modules/lambda/.terraform/tmp/posts-update.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_file         = "./../../../go-functions/bin/posts-update/bootstrap"
      + type                = "zip"
    }

  # module.lambda.data.aws_iam_policy_document.lambda_assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.lambda.aws_cloudwatch_log_group.create_mindmap will be created
  + resource "aws_cloudwatch_log_group" "create_mindmap" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/blog-create-mindmap-go"
      + name_prefix                 = (known after apply)
      + region                      = "ap-northeast-1"
      + retention_in_days           = 14
      + skip_destroy                = false
      + tags                        = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "lambda"
          + "Project"     = "serverless-blog"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Module"      = "lambda"
          + "Project"     = "serverless-blog"
        }
    }

  # module.lambda.aws_cloudwatch_log_group.delete_mindmap will be created
  + resource "aws_cloudwatch_log_group" "delete_mindmap" {
      + arn                         = (known after apply)
      + deletion_protection_enabled = (known after apply)
      + id                          = (known after apply)
      + log_group_class             = (known after apply)
      + name                        = "/aws/lambda/blog-delete-mindmap-go

... (truncated)
```

</details>